Tekla Open API Reference for Tekla Structures 2025
ModelObject.IsUpToDate Property
Gets if the object does not have a modification which is not shared.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsUpToDate { get; }
Public ReadOnly Property IsUpToDate As Boolean
	Get
Return Value
Type: Boolean
True if object was written out (for sharing) or saved (for multiuser) after last editing.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace